Tutorials-Foam-Extend-3.1/compressible/forwardStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }
    
    U
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }
    
    p
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }

    "(h|k|omega)"
    {
        $U;
    }
}

PISO
{
    momentumPredictor	true;
    nNonOrthogonalCorrectors 0;
    nCorrectors		2;
}

// ************************************************************************* //
